src/cf/InformationRegisters/GDS_НастройкиВнешнихСоединений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>GDS_НастройкиВнешнихСоединений</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СтрокаСоединенияИБ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>АдресСервера</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИмяБазы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>АдресРесурса</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Логин</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Пароль</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Порт</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ИдентификаторБазы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>32</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УзелИнтеграции</Name>
					<Type>
						<v8:TypeSet>cfg:ExchangePlanRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидНастройки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.GDS_ВидыНастроекВнешнихСоединений</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/GDS_НастройкиВнешнихСоединений/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

Функция НовыйНастройки() Экспорт
	
	Настройки = Новый Структура;
	Настройки.Вставить("АдресСервера", "");
	Настройки.Вставить("ИмяБазы", "");
	Настройки.Вставить("АдресРесурса", "");
	Настройки.Вставить("Порт", "");
	Настройки.Вставить("Логин", "");
	Настройки.Вставить("Пароль", "");
	
	Возврат Настройки;
	
КонецФункции

Функция Прочитать(ИдентификаторБазы, ВидНастройки, УзелИнтеграции = Неопределено) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Настройки = НовыйНастройки();
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("ИдентификаторБазы", ИдентификаторБазы);
	Запрос.УстановитьПараметр("УзелИнтеграции", УзелИнтеграции);
	Запрос.УстановитьПараметр("ВидНастройки", ВидНастройки);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Настройки.АдресСервера КАК АдресСервера,
	|	Настройки.ИмяБазы КАК ИмяБазы,
	|	Настройки.АдресРесурса КАК АдресРесурса,
	|	Настройки.Порт КАК Порт,
	|	Настройки.Логин КАК Логин,
	|	Настройки.Пароль КАК Пароль
	|ИЗ
	|	РегистрСведений.GDS_НастройкиВнешнихСоединений КАК Настройки
	|ГДЕ
	|	Настройки.ИдентификаторБазы = &ИдентификаторБазы
	|	И Настройки.ВидНастройки = &ВидНастройки";
	
	Если ЗначениеЗаполнено(УзелИнтеграции) Тогда
		Запрос.Текст = Запрос.Текст + " И Настройки.УзелИнтеграции = &УзелИнтеграции";
	КонецЕсли;
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(Настройки, Выборка);
	КонецЕсли;
	
	Возврат Настройки;
	
КонецФункции

#КонецОбласти

#КонецЕсли
